
secret_number = 7

while True:
    guess = int(input("Угадайте цифру: "))

    if guess == secret_number:
        print("Поздравляю! Вы угадали!")
        break
    else:
        print("Попробуйте снова")

# Задаем секретное число
secret_number = 7

# Начинаем бесконечный цикл
while True:
    # Запрашиваем у пользователя ввод числа
    guess = int(input("Угадайте цифру: "))

    # Проверяем, угадал ли пользователь секретное число
    if guess == secret_number:
        print("Поздравляю! Вы угадали!")  # Если угадал, поздравляем
        break  # Выходим из цикла
    else:
        print("Попробуйте снова")  # Если не угадал, просим попробовать снова
