
results = [
    "результат операции: 42",
    "результат операции: 54",
    "результат работы программы: 209",
    "результат: 2"
]


def main(result_str):

    return int(result_str.split(':')[1].strip()) + 10


for result in results:
    print(main(result))

# Список с результатами операций
results = [
    "результат операции: 42",
    "результат операции: 54",
    "результат работы программы: 209",
    "результат: 2"
]

# Функция для обработки строки с результатом
def main(result_str):
    # Извлекаем число из строки, преобразуем в целое и добавляем 10
    return int(result_str.split(':')[1].strip()) + 10

# Перебираем каждый результат в списке results
for result in results:
    # Вызываем функцию main и выводим результат
    print(main(result))
